      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORM2.
       AUTHOR. VS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       MULAI.
           PERFORM PAGAR.
           DISPLAY "   C O B O L".
           PERFORM PAGAR.
           STOP RUN.
       PAGAR.
           DISPLAY '***************'.
       END PROGRAM PERFORM2.
