      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. UJIAN.
       AUTHOR. VS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 X PIC 9(7).
       77 Y PIC +Z9(5).
       PROCEDURE DIVISION.
       MULAI.
            MOVE 0001234 TO X.
            MOVE X TO Y.
            DISPLAY Y.
            STOP RUN.
       END PROGRAM UJIAN.
