IDENTIFICATION DIVISION.
PROGRAM-ID. YOUR-PROGRAM-NAME.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
77 N PIC 9.
77 I PIC 9.
77 GARIS PIC X(71) VALUE ALL '-'.
01 TABEL-MAHASISWA.
    02 DATA-MHS OCCURS 42 TIMES.
       03 NPM PIC X(8).
       03 NAMA PIC X(20).
       03 NILAI PIC 9(3).
       03 KETERANGAN PIC A(5).
01 JUDUL PIC X(50) VALUE "                    TABEL NILAI MAHASISWA".
01 JUDUL-KOLOM.
    02 FILLER PIC X(2) VALUE '| '.
    02 FILLER PIC X(13) VALUE '  NPM      '.
    02 FILLER PIC X(2) VALUE '| '.
    02 FILLER PIC X(26) VALUE '  NAMA                   '.
    02 FILLER PIC X(2) VALUE '| '.
    02 FILLER PIC X(9) VALUE '  NILAI  '.
    02 FILLER PIC X(2) VALUE '| '.
    02 FILLER PIC X(14) VALUE '  KETERANGAN  '.
    02 FILLER PIC X(2) VALUE '| '.
01 ISI.
    02 FILLER PIC X(2) VALUE '| '.
    02 DATA-NPM PIC X(13).
    02 FILLER PIC X(2) VALUE '| '.
    02 DATA-NAMA PIC X(26).
    02 FILLER PIC X(2) VALUE '| '.
    02 DATA-NILAI PIC X(9).
    02 FILLER PIC X(2) VALUE '| '.
    02 DATA-KETERANGAN PIC X(14).
    02 FILLER PIC X(2) VALUE '| '.
SCREEN SECTION.
PROCEDURE DIVISION.
AWAL.
    COMPUTE I=1.
    DISPLAY "JUMLAH DATA : ".
    ACCEPT N.
    PERFORM MASUKKAN-DATA N TIMES.
    DISPLAY SPACES.
    PERFORM TAMPILAN N TIMES.
    STOP RUN.
MASUKKAN-DATA.
    DISPLAY 'NPM : '.
    ACCEPT NPM(N).
    DISPLAY 'NAMA : '.
    ACCEPT NAMA(N).
    DISPLAY 'NILAI : '.
    ACCEPT NILAI(N).
    IF NILAI(N)>70
        DISPLAY 'KETERANGAN : LULUS'
        MOVE 'LULUS' TO KETERANGAN(N).
    IF NILAI(N) <= 70
        DISPLAY 'KETERANGAN : GAGAL'
        MOVE 'GAGAL' TO KETERANGAN(N).
    DISPLAY SPACES.
    COMPUTE I = I + 1.
ISI-TABEL.
    MOVE NPM(N) TO DATA-NPM.
    MOVE NAMA(N) TO DATA-NAMA.
    MOVE NILAI(N) TO DATA-NILAI.
    MOVE KETERANGAN(N) TO DATA-KETERANGAN.
    DISPLAY ISI.
    COMPUTE I = I + 1.
TAMPILAN.
    DISPLAY JUDUL.
    DISPLAY GARIS.
    DISPLAY JUDUL-KOLOM.
    DISPLAY GARIS.
    PERFORM ISI-TABEL N TIMES.
    DISPLAY GARIS.
END PROGRAM YOUR-PROGRAM-NAME.
